# 20 Panda Functions to boost Data Analysis

In [1]:
# Importing the libraries
import numpy as np
import pandas as pd

In [ ]:
# Sample DataFrame
values_1 = np.random.randint(10, size = 10)
values_2 = np.random.randint(10, size = 10)
years = np.arange(2010, 2020)
groups = ['A','A','B','A','B','B','C','A','C','C']

df = pd.DataFrame ({'group' : groups, 'year': years, 'value_1':values_1, 'value_2':values_2})

df

## 1. Query
Filter a dataframe based on a condition or apply a mask to get certain values.

In [3]:
df.query('value_1 < value_2')

  group  year  value_1  value_2
1     A  2011        2        9
6     C  2016        4        9
7     A  2017        8        9

## 2. Insert
Used to add a new column to a dataframe, at any location using insert function.

We need to specify the position by passing an **index** as first argument, **column name** as second argument and **series** or **array-like** object as third argument.

In [4]:
# New Column
new_col = np.random.randn(10)

# Insert the new columns at position 2
df.insert(2, 'new_col', new_col)
df

  group  year   new_col  value_1  value_2
0     A  2010  0.481033        9        5
1     A  2011 -0.816668        2        9
2     B  2012 -0.711052        9        9
3     A  2013 -0.021827        4        3
4     B  2014 -1.428239        9        6
5     B  2015  0.459038        2        1
6     C  2016 -2.011737        4        9
7     A  2017  2.477067        8        9
8     C  2018  0.673653        9        1
9     C  2019 -0.018974        5        3

## 3. Cumsum
Function to calculate the cumulative sum, we can pair it with `groupby` and use the `cumsum` function to have powerful analysis.

In [5]:
# Grouping by groups and adding the value_2 in each row for cumulative sum
df['cumsum_2'] = df[['value_2', 'group']].groupby('group').cumsum()
df

  group  year   new_col  value_1  value_2  cumsum_2
0     A  2010  0.481033        9        5         5
1     A  2011 -0.816668        2        9        14
2     B  2012 -0.711052        9        9         9
3     A  2013 -0.021827        4        3        17
4     B  2014 -1.428239        9        6        15
5     B  2015  0.459038        2        1        16
6     C  2016 -2.011737        4        9         9
7     A  2017  2.477067        8        9        26
8     C  2018  0.673653        9        1        10
9     C  2019 -0.018974        5        3        13

## 4. Sample
Allows us to select values randomly from a **Series** or **DataFrame**. It is useful when we want to select a random sample from a distribution.

In [7]:
# Taking a sample 
sample1 = df.sample(n = 3)
sample1

  group  year   new_col  value_1  value_2  cumsum_2
6     C  2016 -2.011737        4        9         9
9     C  2019 -0.018974        5        3        13
7     A  2017  2.477067        8        9        26

We specify the number of values with `n` parameter but we can also pass a ratio to `frac` parameter. For instance, 0.5 will return half of the rows.

In [8]:
# Taking another sample
sample2 = df.sample(frac = 0.5)
sample2

  group  year   new_col  value_1  value_2  cumsum_2
9     C  2019 -0.018974        5        3        13
4     B  2014 -1.428239        9        6        15
2     B  2012 -0.711052        9        9         9
5     B  2015  0.459038        2        1        16
3     A  2013 -0.021827        4        3        17

To obtain reproducible sample, we can use `random_state` parameter.

## 5. Where
It is used to replace values in rows or columns based on a condition. The default replacement values is NaN but we can also specify the value to be put as a replacement.

In [9]:
df['new_col'].where(df['new_col'] > 0, 0)

0    0.481033
1    0.000000
2    0.000000
3    0.000000
4    0.000000
5    0.459038
6    0.000000
7    2.477067
8    0.673653
9    0.000000
Name: new_col, dtype: float64

One important point is that **“where”** for Pandas and NumPy are not exactly the same. We can achieve the same result but with slightly different syntax. With **DataFrame.where**, the values that fit the condition are selected as is and the other values are replaced with the specified value. **Np.where** requires to also specify the value for the ones that fit the condition. The following two lines return the same result:

In [10]:
df['new_col'].where(df['new_col'] > 0 , 0)

np.where(df['new_col'] < 0, df['new_col'], 0)

array([ 0.        , -0.81666769, -0.71105243, -0.02182694, -1.42823921,
        0.        , -2.01173727,  0.        ,  0.        , -0.01897364])

## 6. Isin
`Isin` is kind of an advanced filtering, we can even filter values based on a list of selections.

In [12]:
# Using the isin function
years = ['2010', '2014', '2017']
df[df.year.isin(years)]

  group  year   new_col  value_1  value_2  cumsum_2
0     A  2010  0.481033        9        5         5
4     B  2014 -1.428239        9        6        15
7     A  2017  2.477067        8        9        26

## 7. Loc and iloc
Loc and iloc are used to select rows and columns.
- `loc`: Select by labels
- `iloc`: Select by positions

In [13]:
# Using iloc to select by positions
df.iloc[:3, :2]

  group  year
0     A  2010
1     A  2011
2     B  2012

In [15]:
# Using iloc to select by labels(column names)
df.loc[:2, ['group', 'year', 'new_col']]

  group  year   new_col
0     A  2010  0.481033
1     A  2011 -0.816668
2     B  2012 -0.711052

**Note : Upper boundaries of indices are included when loc is used whereas they are excluded when iloc is used.** 

> Refer to the example above.

In [16]:
df.loc[[1, 3, 5], ['year', 'value_1']]

   year  value_1
1  2011        2
3  2013        4
5  2015        2

## 8. Pct_change
This function is used to calculate the percent change through the values in a series. Pct_change function is useful in comparing the percentage of change in a time series of elements.

> We have a series, [2, 3, 6]. If we apply pct_change to this series, the returned series will be [NaN, 0.5, 1.0]. There is a 50% increase from the first element to the second and 100% from the second to third one.

In [17]:
df.value_1.pct_change()

0         NaN
1   -0.777778
2    3.500000
3   -0.555556
4    1.250000
5   -0.777778
6    1.000000
7    1.000000
8    0.125000
9   -0.444444
Name: value_1, dtype: float64

## 9. Rank
Rank function assigns rank to the values. 
> Assume we have a series that contains [1, 7, 5, 3]. The ranks assigned to these values will be [1, 4, 3, 2].

In [19]:
df['rank_1'] = df['value_1'].rank()
df

  group  year   new_col  value_1  value_2  cumsum_2  rank_1
0     A  2010  0.481033        9        5         5     8.5
1     A  2011 -0.816668        2        9        14     1.5
2     B  2012 -0.711052        9        9         9     8.5
3     A  2013 -0.021827        4        3        17     3.5
4     B  2014 -1.428239        9        6        15     8.5
5     B  2015  0.459038        2        1        16     1.5
6     C  2016 -2.011737        4        9         9     3.5
7     A  2017  2.477067        8        9        26     6.0
8     C  2018  0.673653        9        1        10     8.5
9     C  2019 -0.018974        5        3        13     5.0

## 10. Melt
It is used to convert wide dataframes to narrow ones. Some dataframes are structured in a way that consecutive measurements or variable are represented as columns. In some cases, representing these columns as rows may fit better to our task.